Repository: RobinDeBock/phone-library
Catalog: PhoneLibrary/*.lproj/Localizable.strings
Languages: nl_be

source: An error occured when fetching the devices, please try again.
nl_be: Er is een fout opgetreden bij het ophalen van de apparaten. Probeer het opnieuw.

source: An error occured when trying to add the device to favorites. Please try again
nl_be: Er is een fout opgetreden bij het toevoegen van het apparaat aan favorieten. Probeer het opnieuw

source: An error occured when trying to remove the device from favorites. Please try again
nl_be: Er is een fout opgetreden bij het verwijderen van het apparaat uit favorieten. Probeer het opnieuw

source: Announced
nl_be: Bekend gemaakt

source: Battery
nl_be: Batterij

source: Card slot
nl_be: Geheugen kaart slot

source: Dimensions
nl_be: Afmetingen

source: Dismiss
nl_be: Verberg

source: Done
nl_be: Gereed

source: Edit
nl_be: Wijzig

source: Find a device and save to favorites
nl_be: Zoek een apparaat en sla op naar favorieten

source: Front camera
nl_be: Camera voor

source: Go Back
nl_be: Ga terug

source: Headphone jack
nl_be: Koptelefoon aansluiting

source: Invalid API token
nl_be: Ongeldige token

source: Make sure your device is connected to the internet.
nl_be: Zorg ervoor dat uw apparaat verbinding heeft met internet.

source: Missing API token
nl_be: API token ontbreekt

source: Newly added
nl_be: Juist toegevoegd

source: No
nl_be: Nee

source: No favorites
nl_be: Geen favorieten

source: No internet connection
nl_be: Geen internet verbinding

source: Nothing found
nl_be: Niets gevonden

source: Open settings
nl_be: Open instellingen

source: Operating system
nl_be: Besturingssysteem

source: Physical
nl_be: Fysiek

source: Rear camera
nl_be: Camera achter

source: Release
nl_be: Uitgebracht

source: Resolution
nl_be: Resolutie

source: Screen size
nl_be: Scherm afmetingen

source: Sim type
nl_be: Type sim

source: Something went wrong
nl_be: Er is iets misgelopen

source: The API token is invalid, necessary for using the API. Please get a viable token at fonoapi.freshpixl.com.
nl_be: De token is ongeldig, nodig om de API te gebruiken. Gelieve er een krijgen via fonoapi.freshpixl.com.

source: There is no token present, necessary for using the API. Please get a viable token at fonoapi.freshpixl.com.
nl_be: Er is geen token aanwezig, nodig om de API te gebruiken. Gelieve er een krijgen via fonoapi.freshpixl.com.

source: Try another device or brand name
nl_be: Probeer een andere apparaat of merknaam

source: Weight
nl_be: Gewicht

source: Yes
nl_be: Ja
